## Introduction to Pandas - DataFrame

In [1]:
import pandas as pd
import numpy as np

In [2]:
# name attribute
s = pd.Series(np.random.randn(5), name='My Attr')
print (s)

0    0.060830
1    0.797448
2   -0.895407
3    0.149045
4   -1.090624
Name: My Attr, dtype: float64

In [3]:
s.name

'My Attr'

### DataFrame

In [2]:
d = {'one' : pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
     'two' : pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd']),
     'three 3' : pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(d)
df

   one  two  three 3
a  1.0  1.0      1.0
b  2.0  2.0      2.0
c  3.0  3.0      3.0
d  NaN  4.0      4.0

In [3]:
df['three 3']

a    1.0
b    2.0
c    3.0
d    4.0
Name: three 3, dtype: float64

name_df_s[[hdg, gfd]]

In [ ]:
df[CONDITION]

In [6]:
df[['one', 'three 3']]

   one  three 3
a  1.0      1.0
b  2.0      2.0
c  3.0      3.0
d  NaN      4.0

In [8]:
df

   one  two  three 3
a  1.0  1.0      1.0
b  2.0  2.0      2.0
c  3.0  3.0      3.0
d  NaN  4.0      4.0

In [9]:
4.0 in df

False

In [11]:
df.columns

Index(['one', 'two', 'three 3'], dtype='object')

In [12]:
pd.DataFrame(d, index=['d', 'b', 'a'])

   one  two  three 3
d  NaN  4.0      4.0
b  2.0  2.0      2.0
a  1.0  1.0      1.0

In [27]:
df

   one  two  three 3
a  1.0  1.0      1.0
b  2.0  2.0      2.0
c  3.0  3.0      3.0
d  NaN  4.0      4.0

In [23]:
df.iloc[3]

one        NaN
two        4.0
three 3    4.0
Name: d, dtype: float64

In [28]:
df.loc[['d', 'a']]

   one  two  three 3
d  NaN  4.0      4.0
a  1.0  1.0      1.0

In [30]:
df.two

a    1.0
b    2.0
c    3.0
d    4.0
Name: two, dtype: float64

In [19]:
res = df.iloc[3]
res

one        NaN
two        4.0
three 3    4.0
Name: d, dtype: float64

In [20]:
type(res)

pandas.core.series.Series

In [22]:
res.index

Index(['one', 'two', 'three 3'], dtype='object')

### How to get row by index in this 2D array?

In [17]:
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [16]:
df.loc['d']

one    NaN
two    4.0
Name: d, dtype: float64

In [18]:
s = pd.Series(np.nan, index=[49,48,47,46,45, 1, 2, 3, 4, 5])
s

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
dtype: float64

In [19]:
s.iloc[:3]

49   NaN
48   NaN
47   NaN
dtype: float64

In [22]:
s.loc[:3] # what is the difference between LOC and ILOC?

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
dtype: float64

In [31]:
df

   one  two  three 3
a  1.0  1.0      1.0
b  2.0  2.0      2.0
c  3.0  3.0      3.0
d  NaN  4.0      4.0

In [36]:
df.iloc[1]

one        2.0
two        2.0
three 3    2.0
Name: b, dtype: float64

In [35]:
df.iloc[1].name

'b'

In [25]:
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [26]:
# row names
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [27]:
# column names
df.columns

Index(['one', 'two'], dtype='object')

In [37]:
# create it from a dict of lists
d = {'one' : [1., 2., 3., 4.], 'two' : [4., 3., 2., 1.]}
df = pd.DataFrame(d, dtype='int64')
df

   one  two
0    1    4
1    2    3
2    3    2
3    4    1

In [40]:
df.two = df.two.astype('float')

In [41]:
df

   one  two
0    1  4.0
1    2  3.0
2    3  2.0
3    4  1.0

In [42]:
df.one.dtype, df.two.dtype

(dtype('int64'), dtype('float64'))

In [43]:
data = np.zeros((2,), dtype=[('A', 'i4'),('B', 'f4'),('C', 'a10')])
data

array([(0, 0., b''), (0, 0., b'')],
      dtype=[('A', '<i4'), ('B', '<f4'), ('C', 'S10')])

In [34]:
data = np.zeros((2,), dtype=[('A', 'i4'),('B', 'f4'),('C', 'a10')])
print("data is " + str(data))
data[:] = [(1,2.,'Hello'), (2,3.,"World")]
pd.DataFrame(data)

data is [(0, 0., b'') (0, 0., b'')]

   A    B         C
0  1  2.0  b'Hello'
1  2  3.0  b'World'

In [44]:
df

   one  two
0    1  4.0
1    2  3.0
2    3  2.0
3    4  1.0

In [45]:
df['three'] = df['one'] * df['two'] # element-wise multiplication
print(df)

   one  two  three
0    1  4.0    4.0
1    2  3.0    6.0
2    3  2.0    6.0
3    4  1.0    4.0

In [47]:
df['new'] = pd.Series([1, 1, 1, 1])
df

   one  two  three  new
0    1  4.0    4.0    1
1    2  3.0    6.0    1
2    3  2.0    6.0    1
3    4  1.0    4.0    1

In [49]:
df['new_duplicate'] = df.new
df

   one  two  three  new  new_duplicate
0    1  4.0    4.0    1              1
1    2  3.0    6.0    1              1
2    3  2.0    6.0    1              1
3    4  1.0    4.0    1              1

In [51]:
df['flag'] = df['one'] > 2
df

   one  two  three  new  new_duplicate   flag
0    1  4.0    4.0    1              1  False
1    2  3.0    6.0    1              1  False
2    3  2.0    6.0    1              1   True
3    4  1.0    4.0    1              1   True

In [ ]:
df[SLICING CONDITION] -> df[COLUMN == VALUE]

In [56]:
df.flag == True

0    False
1    False
2     True
3     True
Name: flag, dtype: bool

In [57]:
df[df.flag == True]

   one  two  three  new  new_duplicate  flag
2    3  2.0    6.0    1              1  True
3    4  1.0    4.0    1              1  True

In [58]:
del df['new_duplicate']
df

   one  two  three  new   flag
0    1  4.0    4.0    1  False
1    2  3.0    6.0    1  False
2    3  2.0    6.0    1   True
3    4  1.0    4.0    1   True

In [60]:
three = df.pop('three')
df

   one  two  new   flag
0    1  4.0    1  False
1    2  3.0    1  False
2    3  2.0    1   True
3    4  1.0    1   True

In [61]:
three

0    4.0
1    6.0
2    6.0
3    4.0
Name: three, dtype: float64

In [62]:
df['foo'] = 'bar'
df

   one  two  new   flag  foo
0    1  4.0    1  False  bar
1    2  3.0    1  False  bar
2    3  2.0    1   True  bar
3    4  1.0    1   True  bar

In [63]:
# insert a column
df.insert(1, 'bar', df['one'])
df

   one  bar  two  new   flag  foo
0    1    1  4.0    1  False  bar
1    2    2  3.0    1  False  bar
2    3    3  2.0    1   True  bar
3    4    4  1.0    1   True  bar

In [64]:
# select row at index 2
df.loc[2]

one        3
bar        3
two        2
new        1
flag    True
foo      bar
Name: 2, dtype: object

Data Alignment and Arithmetic

In [67]:
df = pd.DataFrame(np.random.randn(10, 4), columns=['A', 'B', 'C', 'D'])
df

          A         B         C         D
0  1.108939  1.650149  0.051205  0.233148
1  1.083075  0.180039  0.284893  1.621611
2  0.323282  0.942871  0.020415 -0.220198
3  0.360582  0.954918 -1.572407  0.520283
4 -1.310631 -1.064647  1.129854  1.410384
5  1.728470 -1.035209  0.764880 -1.712889
6  0.610997  0.947383 -0.056857 -1.392319
7  0.063278 -0.027370 -0.523290 -0.556584
8 -0.161093 -0.411477  1.518313  1.388762
9  1.006570 -0.358103  0.547833  1.199711

In [68]:
df2 = pd.DataFrame(np.random.randn(7, 3), columns=['A', 'B', 'C'])
df2

          A         B         C
0 -0.083924  1.024983 -0.247760
1  0.823024 -0.576568  1.099998
2  1.221680  0.743203 -0.034801
3 -0.449067 -0.008442  1.010392
4  1.259991  0.468668 -0.280254
5  0.128067 -0.738551  0.093714
6  1.246004 -0.321849 -1.377114

In [69]:
df + df2

          A         B         C   D
0  1.025015  2.675132 -0.196555 NaN
1  1.906098 -0.396528  1.384891 NaN
2  1.544962  1.686074 -0.014386 NaN
3 -0.088485  0.946475 -0.562015 NaN
4 -0.050640 -0.595978  0.849600 NaN
5  1.856538 -1.773759  0.858593 NaN
6  1.857001  0.625535 -1.433970 NaN
7       NaN       NaN       NaN NaN
8       NaN       NaN       NaN NaN
9       NaN       NaN       NaN NaN

In [70]:
df

          A         B         C         D
0  1.108939  1.650149  0.051205  0.233148
1  1.083075  0.180039  0.284893  1.621611
2  0.323282  0.942871  0.020415 -0.220198
3  0.360582  0.954918 -1.572407  0.520283
4 -1.310631 -1.064647  1.129854  1.410384
5  1.728470 -1.035209  0.764880 -1.712889
6  0.610997  0.947383 -0.056857 -1.392319
7  0.063278 -0.027370 -0.523290 -0.556584
8 -0.161093 -0.411477  1.518313  1.388762
9  1.006570 -0.358103  0.547833  1.199711

In [71]:
df - df.loc[0]

          A         B         C         D
0  0.000000  0.000000  0.000000  0.000000
1 -0.025865 -1.470110  0.233688  1.388463
2 -0.785657 -0.707278 -0.030790 -0.453346
3 -0.748357 -0.695232 -1.623612  0.287135
4 -2.419570 -2.714796  1.078649  1.177236
5  0.619531 -2.685358  0.713675 -1.946037
6 -0.497942 -0.702766 -0.108062 -1.625467
7 -1.045661 -1.677519 -0.574495 -0.789732
8 -1.270032 -2.061627  1.467108  1.155614
9 -0.102369 -2.008253  0.496628  0.966563

In [72]:
ind = pd.date_range('21/10/2020', periods=8)
ind

DatetimeIndex(['2020-10-21', '2020-10-22', '2020-10-23', '2020-10-24',
               '2020-10-25', '2020-10-26', '2020-10-27', '2020-10-28'],
              dtype='datetime64[ns]', freq='D')

In [73]:
# the dataframe index is time series
ind = pd.date_range('21/10/2020', periods=8)
df = pd.DataFrame(np.random.randn(8, 3), index=ind, columns=list('ABC'))
df

                   A         B         C
2020-10-21  0.422468 -1.456957  0.138724
2020-10-22  2.043734  0.953487 -0.295139
2020-10-23  1.009265  1.086528 -0.669691
2020-10-24  0.695637 -0.709969 -0.102583
2020-10-25  0.630592 -0.957539 -0.757170
2020-10-26 -0.673760 -1.056591 -1.941528
2020-10-27 -1.046092 -1.081980 -0.729270
2020-10-28  0.820854  1.612167  0.509054

In [74]:
type(df['A'])

pandas.core.series.Series

In [75]:
df.sub(df['A'], axis=0) # it was df - df['A']

              A         B         C
2020-10-21  0.0 -1.879425 -0.283744
2020-10-22  0.0 -1.090248 -2.338873
2020-10-23  0.0  0.077263 -1.678956
2020-10-24  0.0 -1.405606 -0.798220
2020-10-25  0.0 -1.588131 -1.387761
2020-10-26  0.0 -0.382830 -1.267768
2020-10-27  0.0 -0.035888  0.316822
2020-10-28  0.0  0.791313 -0.311800

In [76]:
df * 5 + 2

                    A          B         C
2020-10-21   4.112342  -5.284785  2.693620
2020-10-22  12.218672   6.767434  0.524305
2020-10-23   7.046324   7.432638 -1.348456
2020-10-24   5.478184  -1.549845  1.487084
2020-10-25   5.152959  -2.787697 -1.785848
2020-10-26  -1.368801  -3.282953 -7.707642
2020-10-27  -3.230461  -3.409898 -1.646349
2020-10-28   6.104269  10.060833  4.545271

In [77]:
df

                   A         B         C
2020-10-21  0.422468 -1.456957  0.138724
2020-10-22  2.043734  0.953487 -0.295139
2020-10-23  1.009265  1.086528 -0.669691
2020-10-24  0.695637 -0.709969 -0.102583
2020-10-25  0.630592 -0.957539 -0.757170
2020-10-26 -0.673760 -1.056591 -1.941528
2020-10-27 -1.046092 -1.081980 -0.729270
2020-10-28  0.820854  1.612167  0.509054

In [78]:
1 / df

                   A         B         C
2020-10-21  2.367041 -0.686362  7.208555
2020-10-22  0.489300  1.048782 -3.388233
2020-10-23  0.990820  0.920363 -1.493226
2020-10-24  1.437532 -1.408512 -9.748181
2020-10-25  1.585812 -1.044344 -1.320708
2020-10-26 -1.484207 -0.946440 -0.515058
2020-10-27 -0.955939 -0.924232 -1.371235
2020-10-28  1.218244  0.620283  1.964427

Boolean Operators

In [81]:
type('what')

str

In [82]:
'what' == True

False

In [88]:
bool(0)

False

In [90]:
df1 = pd.DataFrame({'a' : ['what', 0, 1], 'b' : [0, 1, ''] }, dtype=bool)
df1

       a      b
0   True  False
1  False   True
2   True  False

In [91]:
df2 = pd.DataFrame({'a' : [0, 1, 1], 'b' : [1, 1, 0] }, dtype=bool)
df2

       a      b
0  False   True
1   True   True
2   True  False

In [92]:
df1 & df2 # AND

       a      b
0  False  False
1  False   True
2   True  False

In [98]:
df1 | df2 # OR

      a      b
0  True   True
1  True   True
2  True  False

In [94]:
df1 ^ df2 # XOR

       a      b
0   True   True
1   True  False
2  False  False

In [95]:
-df1 # NOT

       a      b
0  False   True
1   True  False
2  False   True

Trasposing

In [96]:
df

                   A         B         C
2020-10-21  0.422468 -1.456957  0.138724
2020-10-22  2.043734  0.953487 -0.295139
2020-10-23  1.009265  1.086528 -0.669691
2020-10-24  0.695637 -0.709969 -0.102583
2020-10-25  0.630592 -0.957539 -0.757170
2020-10-26 -0.673760 -1.056591 -1.941528
2020-10-27 -1.046092 -1.081980 -0.729270
2020-10-28  0.820854  1.612167  0.509054

In [97]:
#trapspose 
df.T

,2020-10-21,2020-10-22,2020-10-23,2020-10-24,2020-10-25,2020-10-26,2020-10-27,2020-10-28
A,0.422468,2.043734,1.009265,0.695637,0.630592,-0.673760,-1.046092,0.820854
B,-1.456957,0.953487,1.086528,-0.709969,-0.957539,-1.056591,-1.081980,1.612167
C,0.138724,-0.295139,-0.669691,-0.102583,-0.757170,-1.941528,-0.729270,0.509054

Interoperability with Numpy Functions

In [66]:
np.asarray(df)

array([[-0.60115992,  0.82964759, -1.16809434],
       [ 1.07052566, -0.92086312,  2.05531463],
       [ 1.07891619,  0.31716092, -1.69852767],
       [-1.64821697, -2.51251476, -0.85841723],
       [-0.55138496, -0.5846293 ,  0.85139114],
       [ 0.36712303,  2.34575771,  0.80017813],
       [-1.13158589,  0.98092565,  0.82541184],
       [-0.92152572, -0.29935727, -0.72863282]])

Matrix Multiplication

In [67]:
df.T.dot(df)

          A          B          C
A  7.956599   3.348202   2.046516
B  3.348202  14.845826   1.163374
C  2.046516   1.163374  11.788001

GroupBy

In [106]:
df = pd.DataFrame({'BoolCol': [True, False, False, True, True]}, index=[10,20,30,40,50])
df['new_col'] = [10, 122, 13, 14, 15]
df

    BoolCol  new_col
10     True       10
20    False      122
30    False       13
40     True       14
50     True       15

In [108]:
df[['new_col']]

    new_col
10       10
20      122
30       13
40       14
50       15

In [107]:
df[df['BoolCol']] # exactly the same as df[df.BoolCol == True]

    BoolCol  new_col
10     True       10
40     True       14
50     True       15

In [103]:
df[df['BoolCol']] # I want to slice the dataframe
# df[CONDITION] -> df['BoolCol']

    BoolCol  new_col
10     True       10
40     True       14
50     True       15

In [72]:
df[df['BoolCol']].index.tolist()

[10, 40, 50]